---
kind: property
id: P:Autodesk.Revit.DB.ConicalSurface.Origin
zh: 原点
source: html/41ec6924-4e43-9375-31a4-bdbcf209b454.htm
---
# Autodesk.Revit.DB.ConicalSurface.Origin Property

**中文**: 原点

Apex of the cone. This is the origin of the local coordinate system associated with this cone.

## Syntax (C#)
```csharp
public XYZ Origin { get; }
```